sergz72/ARM/mspm0g350x/ti/driverlib/m0p/dl_factoryregion.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_factoryregion.h
 *  @brief      Factory Region Driver Library
 *  @defgroup   FACTORYREGION Factory Region (FACTORYREGION)
 *
 *  @anchor ti_dl_dl_factoryregion_Overview
 *  # Overview
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup FACTORYREGION
 * @{
 */
#ifndef ti_dl_dl_factoryregion__include
#define ti_dl_dl_factoryregion__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

#ifdef __MSPM0GX51X_TRIM_CACHE__

/*!
 * @brief Macro indicating SRAM trim table has been
          initialized
 *
 * This define is used to indicate that the trim
 * table in SRAM has been initialized with values
 * from TRIM.
 */
#define DL_FACTORYREGION_TRIM_FLAG_IS_SET (0xCAFECAFE)

/*! @brief  Data struct for @ref DL_FactoryRegion_initTrimTable. */
typedef struct {
    /*! Trace identifier */
    uint32_t TRACEID;
    /*! Device identifier */
    uint32_t DEVICEID;
    /*! Device variant identifier */
    uint32_t USERID;
    /*! BSL UART pin configuration */
    uint32_t BSLPIN_UART;
    /*! BSL I2C pin configuration */
    uint32_t BSLPIN_I2C;
    /*! BSL pin invocation configuration */
    uint32_t BSLPIN_INVOKE;
    /*! Main, SRAM, and data bank memory size configuration */
    uint32_t SRAMFLASH;
    /*! SYSPLL0 4-8MHZ factory configuration */
    uint32_t PLLSTARTUP0_4_8MHZ;
    /*! SYSPLL1 4-8MHZ factory configuration */
    uint32_t PLLSTARTUP1_4_8MHZ;
    /*! SYSPLL0 8-16MHZ factory configuration */
    uint32_t PLLSTARTUP0_8_16MHZ;
    /*! SYSPLL1 8-16MHZ factory configuration */
    uint32_t PLLSTARTUP1_8_16MHZ;
    /*! SYSPLL0 16-32MHZ factory configuration */
    uint32_t PLLSTARTUP0_16_32MHZ;
    /*! SYSPLL1 16-32MHZ factory configuration */
    uint32_t PLLSTARTUP1_16_32MHZ;
    /*! SYSPLL0 32-48MHZ factory configuration */
    uint32_t PLLSTARTUP0_32_48MHZ;
    /*! SYSPLL1 32-48MHZ factory configuration */
    uint32_t PLLSTARTUP1_32_48MHZ;
    /*! Temperature sensor room temperature calibration code */
    uint32_t TEMP_SENSE0;
    /*! SRAM trim table initialization flag */
    uint32_t DATA_SET;
} DL_FACTORYREGION_TrimValues;

/*!
 * @brief Pointer to trim table values in SRAM
 */
extern DL_FACTORYREGION_TrimValues *FACTORYVALUE;

/**
 *  @brief  Check to see if TRIM content has been copied
 *          to SRAM.
 *
 *  @return      Status of trim table flag.
 *
 *  @retval      Returns '1' if flag has been set.
 *  @retval      Returns '0' if flag has not been set.
 */
__STATIC_INLINE bool DL_FactoryRegion_isTrimTableInSram(void)
{
    return (FACTORYVALUE->DATA_SET == DL_FACTORYREGION_TRIM_FLAG_IS_SET);
}
#endif

/**
 *  @brief   Get the size of the MAIN Flash region
 *
 *  @return  The size of the MAIN Flash region in number of kB.
 */
__STATIC_INLINE uint16_t DL_FactoryRegion_getMAINFlashSize(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t flashSize;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        flashSize = FACTORYVALUE->SRAMFLASH &
                    FACTORYREGION_SRAMFLASH_MAINFLASH_SZ_MASK;
    } else {
        flashSize = FACTORYREGION->SRAMFLASH &
                    FACTORYREGION_SRAMFLASH_MAINFLASH_SZ_MASK;
    }
#else
    uint16_t flashSize =
        FACTORYREGION->SRAMFLASH & FACTORYREGION_SRAMFLASH_MAINFLASH_SZ_MASK;
#endif
    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return flashSize;
}

/**
 *  @brief   Get the size of the SRAM region
 *
 *  @return  The size of the SRAM region in number of kB.
 */
__STATIC_INLINE uint16_t DL_FactoryRegion_getSRAMFlashSize(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t flashSize;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        flashSize =
            (FACTORYVALUE->SRAMFLASH & FACTORYREGION_SRAMFLASH_SRAM_SZ_MASK) >>
            FACTORYREGION_SRAMFLASH_SRAM_SZ_OFS;
    } else {
        flashSize = (FACTORYREGION->SRAMFLASH &
                        FACTORYREGION_SRAMFLASH_SRAM_SZ_MASK) >>
                    FACTORYREGION_SRAMFLASH_SRAM_SZ_OFS;
    }
#else
    uint16_t flashSize =
        (FACTORYREGION->SRAMFLASH & FACTORYREGION_SRAMFLASH_SRAM_SZ_MASK) >>
        FACTORYREGION_SRAMFLASH_SRAM_SZ_OFS;
#endif
    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

