sergz72/ARM/mspm0g350x/ti/driverlib/m0p/dl_factoryregion.h
    return majorRev;
}

/**
 *  @brief   Get the UART RXD PIN used by BSL
 *
 *  @return  The UART RXD PIN used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinUARTRXDPad(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslUARTRXDPad;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslUARTRXDPad = (FACTORYVALUE->BSLPIN_UART &
                            FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_MASK) >>
                        FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_OFS;
    } else {
        bslUARTRXDPad = (FACTORYREGION->BSLPIN_UART &
                            FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_MASK) >>
                        FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_OFS;
    }
#else
    uint8_t bslUARTRXDPad = (FACTORYREGION->BSLPIN_UART &
                                FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_MASK) >>
                            FACTORYREGION_BSLPIN_UART_UART_RXD_PAD_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslUARTRXDPad;
}

/**
 *  @brief   Get the UART RXD Pin function selection value used by BSL
 *
 *  @return  The UART RXD Pin function selection value used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinUARTRXDFunction(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslUARTRXDFunction;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslUARTRXDFunction = (FACTORYVALUE->BSLPIN_UART &
                                 FACTORYREGION_BSLPIN_UART_UART_RXD_PF_MASK) >>
                             FACTORYREGION_BSLPIN_UART_UART_RXD_PF_OFS;
    } else {
        bslUARTRXDFunction = (FACTORYREGION->BSLPIN_UART &
                                 FACTORYREGION_BSLPIN_UART_UART_RXD_PF_MASK) >>
                             FACTORYREGION_BSLPIN_UART_UART_RXD_PF_OFS;
    }
#else
    uint8_t bslUARTRXDFunction =
        (FACTORYREGION->BSLPIN_UART &
            FACTORYREGION_BSLPIN_UART_UART_RXD_PF_MASK) >>
        FACTORYREGION_BSLPIN_UART_UART_RXD_PF_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslUARTRXDFunction;
}

/**
 *  @brief   Get the UART TXD PIN used by BSL
 *
 *  @return  The UART TXD PIN used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinUARTTXDPad(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslUARTTXDPad;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslUARTTXDPad = (FACTORYVALUE->BSLPIN_UART &
                            FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_MASK) >>
                        FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_OFS;
    } else {
        bslUARTTXDPad = (FACTORYREGION->BSLPIN_UART &
                            FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_MASK) >>
                        FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_OFS;
    }
#else
    uint8_t bslUARTTXDPad = (FACTORYREGION->BSLPIN_UART &
                                FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_MASK) >>
                            FACTORYREGION_BSLPIN_UART_UART_TXD_PAD_OFS;
#endif
    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslUARTTXDPad;
}

/**
 *  @brief   Get the UART TXD Pin function selection value used by BSL
 *
 *  @return  The UART TXD Pin function selection value used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinUARTTXDFunction(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslUARTTXDFunction;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslUARTTXDFunction = (FACTORYVALUE->BSLPIN_UART &
                                 FACTORYREGION_BSLPIN_UART_UART_TXD_PF_MASK) >>
                             FACTORYREGION_BSLPIN_UART_UART_TXD_PF_OFS;
    } else {
        bslUARTTXDFunction = (FACTORYREGION->BSLPIN_UART &
                                 FACTORYREGION_BSLPIN_UART_UART_TXD_PF_MASK) >>
                             FACTORYREGION_BSLPIN_UART_UART_TXD_PF_OFS;
    }
#else
    uint8_t bslUARTTXDFunction =
        (FACTORYREGION->BSLPIN_UART &
            FACTORYREGION_BSLPIN_UART_UART_TXD_PF_MASK) >>
        FACTORYREGION_BSLPIN_UART_UART_TXD_PF_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslUARTTXDFunction;
}

/**
 *  @brief   Get the I2C SDA Pin used by BSL
 *
 *  @return  The I2C SDA Pin used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinI2CSDAPad(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslI2CSDAPad;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslI2CSDAPad = (FACTORYVALUE->BSLPIN_I2C &
                           FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_MASK) >>
                       FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_OFS;
    } else {
        bslI2CSDAPad = (FACTORYREGION->BSLPIN_I2C &
                           FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_MASK) >>
                       FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_OFS;
    }
#else
    uint8_t bslI2CSDAPad = (FACTORYREGION->BSLPIN_I2C &
                               FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_MASK) >>
                           FACTORYREGION_BSLPIN_I2C_I2C_SDA_PAD_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslI2CSDAPad;
}

/**
 *  @brief   Get the I2C SDA Pin function selection value used by BSL
 *
 *  @return  The I2C SDA Pin function selection value used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinI2CSDAFunction(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslI2CSDAFunction;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslI2CSDAFunction = (FACTORYVALUE->BSLPIN_I2C &
                                FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_MASK) >>
                            FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_OFS;
    } else {
        bslI2CSDAFunction = (FACTORYREGION->BSLPIN_I2C &
                                FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_MASK) >>
                            FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_OFS;
    }
#else
    uint8_t bslI2CSDAFunction =
        (FACTORYREGION->BSLPIN_I2C &
            FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_MASK) >>
        FACTORYREGION_BSLPIN_I2C_I2C_SDA_PF_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslI2CSDAFunction;
}

/**
 *  @brief   Get the I2C SCL Pin used by BSL
 *
 *  @return  The I2C SCL Pin used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinI2CSCLPad(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslI2CSCLPad;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslI2CSCLPad = (FACTORYVALUE->BSLPIN_I2C &
                           FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_MASK) >>
                       FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_OFS;
    } else {
        bslI2CSCLPad = (FACTORYREGION->BSLPIN_I2C &
                           FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_MASK) >>
                       FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_OFS;
    }
#else
    uint8_t bslI2CSCLPad = (FACTORYREGION->BSLPIN_I2C &
                               FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_MASK) >>
                           FACTORYREGION_BSLPIN_I2C_I2C_SCL_PAD_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslI2CSCLPad;
}

/**
 *  @brief   Get the I2C SCL Pin function selection value used by BSL
 *
 *  @return  The I2C SCL Pin function selection value used by BSL
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinI2CSCLFunction(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslI2CSCLFunction;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslI2CSCLFunction = (FACTORYVALUE->BSLPIN_I2C &
                                FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_MASK) >>
                            FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_OFS;
    } else {
        bslI2CSCLFunction = (FACTORYREGION->BSLPIN_I2C &
                                FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_MASK) >>
                            FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_OFS;
    }
#else
    uint8_t bslI2CSCLFunction =
        (FACTORYREGION->BSLPIN_I2C &
            FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_MASK) >>
        FACTORYREGION_BSLPIN_I2C_I2C_SCL_PF_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

